// ЗАВДАННЯ 1

// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

// const input = prompt("Введіть число:");
// const number = Number(input);

// if (number === 10) {
//   alert("Вірно");
// } else {
//   alert("Невірно");
// }

// -----------------------------------------------
//     ЗАВДАННЯ 2

// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * (59 - 0) + 0);

// const min = 45;

// if (min >= 0 && min < 15) {
//     console.log("First");
    
// } else if (min >= 15 && min < 30) {
//     console.log("Second");
    
// } else if (min >= 30 && min < 44) {
//     console.log("Third");
    
// } else {
//    console.log("Fourth");
// }


// -----------------------------------------------
//     ЗАВДАННЯ 3

// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

// const input = prompt("Введіть значення від 1 до 4");
// const num = Number(input);
// let result;

// switch (num) {
//     case 1:
//         result = "winter";
//         break;
//     case 2:
//         result = "spring";
//         break;
//     case 3:
//         result = "summer";
//         break;
//     case 4:
//         result = "autumn";
//         break;
//     default:
//         result = "Вибачте, але ви маєте ввести значення від 1 до 4 включно";
        
// }
// console.log(result);



// ----------------------------------------------------
    
//     ЗАВДАННЯ 5
// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"

// let login = prompt("Введіть ім'я користувача");

// if (login === "Адмін") {
//     let password = prompt("Введіть пароль");

//     if (password === "Я головний") {
//         alert("Добрий день!");
//     } else if (password === null || password === "") {
//         alert("Скасовано");
//     } else {
//         alert("Невірний пароль");
//     }
// } else if (login === null || login === "") {
//     alert("Скасовано");
// } else {
//     alert("Я вас не знаю");
// }

// --------------------------------------------------------------------------------
// Завдання 6:

// Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.

// let i = 0;

// while (i <= 20) {
//     console.log(i);
//     i++
// }

// while (i <= 20) {
//     if (i % 2 === 0) {
//         console.log(i);
//     }
//     i++;
// }

// while (i <= 20) {
// if (i % 2 !== 0) {
// console.log(i);}
// i++;
// }

// ---------------------------------------------------------------------
//     ЗАВДАННЯ 7

    // Напишіть функцію getNumbers(min, max), що приймає 2 параметри - 
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.

// function getNumbers(min, max) {
//     let sum = 0;

//     for (let i = max; i >= min; i--) {
//         console.log(i);
//         if (i % 2 === 0) {
//             sum += i;
//         }
//     }
//     console.log(sum);
// }
// getNumbers(0, 15);
